In [14]:
import pandas as pd

In [115]:
data_movies = pd.read_csv('movies.csv')

In [117]:
data_ratings = pd.read_csv('ratings.csv')

In [119]:
data_ratings[ data_ratings.rating == 5 ].head(3)

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820

In [131]:
leader_movie = data_ratings[ data_ratings.rating == 5 ]['movieId'].value_counts().head(1)
ind = int(str(leader_movie).split()[0])
ind

318

In [132]:
data_movies[data_movies.movieId == ind]

     movieId                             title       genres
314      318  Shawshank Redemption, The (1994)  Crime|Drama

# Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [24]:
data_power = pd.read_csv('power.csv', sep =',' )

In [25]:
data_power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [111]:
filtered = data_power[((data_power['country']=='Latvia')
          |(data_power['country']=='Lithuania')
          |(data_power['country']=='Estonia'))&
          ((filtered_countries['category']== 4)
          |(filtered_countries['category']== 12)
          |(filtered_countries['category']== 21))&
          ((filtered_countries['year'] >= 2005) 
          & (filtered_countries['year'] <= 2010)
          & (filtered_countries['quantity']>=0))]

In [112]:
filtered.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [113]:
filtered.to_csv('filtered.csv')

In [114]:
total_power = filtered['quantity'].sum()
total_power

240580.0

# Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [85]:
page_url = 'https://www.finanz.ru/valyuty/v-realnom-vremeni'
df_1 = pd.read_html(page_url, attrs = {'class': 'quote_list'}, encoding='utf-8')

In [86]:
df_1

[    Unnamed: 0              Рубль  Предложение  Спрос  Предыдущее закрытие  \
 0          NaN            GBP/RUB       995631      -               996935
 1          NaN            EUR/RUB       900735      -               894690
 2          NaN            USD/RUB       763204      -               757204
 3          NaN            JPY/RUB        07184      -                07125
 4          NaN            CNY/RUB       111554      -               110853
 5          NaN            CHF/RUB       832267      -               826191
 6          NaN               Евро  Предложение  Спрос  Предыдущее закрытие
 7          NaN            EUR/USD        11803      -                11816
 8          NaN            EUR/GBP        09048      -                08977
 9          NaN            EUR/JPY      1253880      -              1255700
 10         NaN            EUR/CHF        10825      -                10827
 11         NaN         Доллар США  Предложение  Спрос  Предыдущее закрытие
 12         NaN            USD/EUR        08472      -                08464
 13         NaN            USD/GBP        07666      -                07595
 14         NaN            USD/JPY      1062425      -              1062780
 15         NaN            USD/CHF        09171      -                09164
 16         NaN      Японская иена  Предложение  Спрос  Предыдущее закрытие
 17         NaN    JPY/EUR (100:1)        08000      -                08000
 18         NaN            JPY/GBP        00072      -                00072
 19         NaN            JPY/USD        00094      -                00094
 20         NaN    JPY/CHF (100:1)        08600      -                08600
 21         NaN    Фунт стерлингов  Предложение  Спрос  Предыдущее закрытие
 22         NaN            GBP/USD        13043      -                13166
 23         NaN            GBP/JPY      1385862      -              1399217
 24         NaN            GBP/EUR        11051      -                11144
 25         NaN            GBP/CHF        11962      -                12068
 26         NaN  Швейцарский франк  Предложение  Спрос  Предыдущее закрытие
 27         NaN            GBP/CHF        11962      -                12068
 28         NaN            EUR/CHF        10825      -                10827
 29         NaN    JPY/CHF (100:1)        08600      -                08600
 30         NaN            USD/CHF        09171      -                09164
 31         NaN  Украинская гривна  Предложение  Спрос  Предыдущее закрытие
 32         NaN            EUR/UAH       328403      -               328264
 33         NaN            USD/UAH       278225      -               277825
 34         NaN            CHF/UAH       303408      -               303137
 35         NaN            GBP/UAH       362945      -               365784

           %  Абсолютное значение     Время
 0   -0,13 %               -01304  14:36:00
 1    0,68 %                06045  14:35:00
 2    0,79 %                06000  14:35:00
 3    0,83 %                00059  14:36:00
 4    0,63 %                00701  14:35:00
 5    0,74 %                06076  14:36:00
 6         %  Абсолютное значение     Время
 7   -0,11 %               -00013  14:35:00
 8    0,80 %                00072  14:35:00
 9   -0,14 %               -01820  14:35:00
 10  -0,02 %               -00002  14:35:00
 11        %  Абсолютное значение     Время
 12   0,10 %                00009  14:36:00
 13   0,94 %                00071  14:36:00
 14  -0,03 %               -00355  14:35:00
 15   0,08 %                00007  14:35:00
 16        %  Абсолютное значение     Время
 17   0,14 %                00000  14:35:00
 18   0,97 %                00001  14:36:00
 19   0,03 %                00000  14:36:00
 20   0,11 %                00000  14:35:00
 21        %  Абсолютное значение     Время
 22  -0,93 %               -00123  14:35:00
 23  -0,95 %               -13355  14:36:00
 24  -0,84 %               -00094  14:35:00
 25  -0,88 %               -00106  14:35:00
 26        %  Абсолютное значение     Время
 27  -0,88 %               -00106  14:35:00
 28  -0,02 %               -00002  14:35:00
 29   0,11 %                00000  14:35:00
 30   0,08 %                00007  14:35:00
 31        %  Абсолютное значение     Время
 32   0,04 %                00139  14:36:00
 33   0,14 %                00400  14:35:00
 34   0,09 %                00271  14:36:00
 35  -0,78 %               -02840  14:36:00  ]